const Ranges = {
  ID: { MIN: 1, MAX: 1000 },
  AVATAR: { MIN: 1, MAX: 6 },
  LIKES: { MIN: 15, MAX: 200 },
  COMMENTS: { MIN: 0, MAX: 30 },
  MESSAGE: { MIN: 1, MAX: 2 },
};

const PHOTOS_COUNT = 25;

const DESCRIPTIONS = [
  'Закат на пляже',
  'Вечеринка в горах',
  'Красивая природа',
  'Городская жизнь',
  'Путешествие мечты',
];

const COMMENTS = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота.',
  'Лица у людей на фотке перекошены, как будто их избивают.',
];

const NAMES = ['Иван', 'Мария', 'Александр', 'Екатерина', 'Сергей', 'Юлия'];

export {Ranges, PHOTOS_COUNT, DESCRIPTIONS, COMMENTS, NAMES};
