const MIN_VALUES = {
  ID: 1,
  AVATAR: 1,
  LIKES: 15,
  COMMENTS: 0,
  MESSAGE: 1,
};

const MAX_VALUES = {
  ID: 1000,
  AVATAR: 6,
  LIKES: 200,
  COMMENTS: 30,
  MESSAGE: 2,
};

const PHOTOS_COUNT = 25;

const DESCRIPTIONS = [
  'Закат на пляже',
  'Вечеринка в горах',
  'Красивая природа',
  'Городская жизнь',
  'Путешествие мечты',
];

const COMMENTS = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота.',
  'Лица у людей на фотке перекошены, как будто их избивают.',
];

const NAMES = ['Иван', 'Мария', 'Александр', 'Екатерина', 'Сергей', 'Юлия'];

export { MIN_VALUES, MAX_VALUES, PHOTOS_COUNT, DESCRIPTIONS, COMMENTS, NAMES };
